apache/nuttx/arch/xtensa/src/esp32/esp32_touch.c
/****************************************************************************
 * arch/xtensa/src/esp32/esp32_touch.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <debug.h>
#include <stdint.h>
#include <sys/types.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/spinlock.h>
#include <arch/irq.h>

#include "xtensa.h"

#include "esp_gpio.h"
#include "esp_irq.h"
#include "esp_hr_timer.h"
#include "espressif/esp_rtc.h"
#include "soc/rtc.h"
#include "esp32_rtc_gpio.h"
#include "esp32_touch.h"
#include "esp32_touch_lowerhalf.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define TOUCH_PAD_FILTER_FACTOR_DEFAULT (4) /* IIR filter coefficient */
#define TOUCH_PAD_SHIFT_DEFAULT         (4) /* Increase computing accuracy */
#define TOUCH_PAD_SHIFT_ROUND_DEFAULT   (8) /* ROUND = 2^(n-1) */
#define TOUCH_THRESHOLD_NO_USE          (0)
#define TOUCH_GET_RTCIO_NUM(channel)    (touch_channel_to_rtcio[channel])

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct touch_config_volt_s
{
  enum touch_high_volt_e refh;
  enum touch_low_volt_e refl;
  enum touch_volt_atten_e atten;
};

struct touch_config_meas_mode_s
{
  enum touch_cnt_slope_e slope;
  enum touch_tie_opt_e tie_opt;
};

#ifdef CONFIG_ESP32_TOUCH_IRQ
struct touchirq_handler_s
{
  xcpt_t handler;
  void  *arg;
};
#endif

#ifdef CONFIG_ESP32_TOUCH_FILTER
struct touch_filter_s
{
  struct esp_hr_timer_args_s filter_timer_args;
  struct esp_hr_timer_s *filter_timer_handler;
  uint16_t filtered_val[TOUCH_SENSOR_PINS];
  uint16_t raw_val[TOUCH_SENSOR_PINS];
  uint32_t period_ms;
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
static int touch_interrupt(int irq, void *context, void *arg);
static void touch_restore_irq(void *arg);
#endif
#ifdef CONFIG_ESP32_TOUCH_FILTER
static uint32_t touch_filter_iir(uint32_t in_now,
                                 uint32_t out_last,
                                 uint32_t k);
static void touch_filter_cb(void *arg);
static void touch_filter_start(uint32_t filter_period_ms);
#endif
static uint16_t touch_read(enum touch_pad_e tp);
static void touch_clear_group_mask(uint16_t set1_mask,
                                   uint16_t set2_mask,
                                   uint16_t en_mask);
static void touch_config(enum touch_pad_e tp);
static void touch_init(void);
static void touch_set_group_mask(uint16_t set1_mask,
                                 uint16_t set2_mask,
                                 uint16_t en_mask);
static void touch_set_meas_mode(enum touch_pad_e tp,
                                struct touch_config_meas_mode_s *meas);
static void touch_set_voltage(struct touch_config_volt_s *volt);
static void touch_io_init(enum touch_pad_e tp);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_FILTER
static struct touch_filter_s *touch_pad_filter = NULL;
#endif
#ifdef CONFIG_ESP32_TOUCH_IRQ
static uint16_t touch_pad_isr_enabled = 0x0000;
static int touch_last_irq = -1;
static int (*touch_release_cb)(int, void *, void *) = NULL;
static struct touchirq_handler_s
  g_touchirq_handlers[ESP32_NIRQ_RTCIO_TOUCHPAD];
static struct esp_hr_timer_args_s irq_timer_args;
static struct esp_hr_timer_s *irq_timer_handler = NULL;
#endif
static mutex_t *touch_mux = NULL;
static uint16_t touch_pad_init_bit = 0x0000;
static uint16_t touch_pad_logic_threshold[TOUCH_SENSOR_PINS];
static spinlock_t lock;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: touch_interrupt
 *
 * Description:
 *   Touch pads interrupt handler.
 *
 * Input Parameters:
 *   irq - Interrupt request number;
 *   context - Context data from the ISR;
 *   arg - Opaque pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.

 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
static int touch_interrupt(int irq, void *context, void *arg)
{
  uint32_t status;
  int i;

  touch_lh_intr_disable();
  status = touch_lh_read_trigger_status_mask();
  touch_lh_clear_trigger_status_mask();

  esp_hr_timer_start_once(irq_timer_handler,
                          CONFIG_ESP32_TOUCH_IRQ_INTERVAL_MS * \
                          USEC_PER_MSEC);

  /* Read and clear the touch interrupt status */

  for (i = 0; i < ESP32_NIRQ_RTCIO_TOUCHPAD; i++)
    {
      if ((touch_pad_init_bit >> i) &
          (touch_pad_isr_enabled >> i) &
          (status >> i) & 0x1)
        {
          int touch_irq = ESP32_FIRST_RTCIOIRQ_TOUCHPAD + i;

          touch_last_irq = touch_irq;

          if (g_touchirq_handlers[i].handler != NULL)
            {
              g_touchirq_handlers[i].handler(touch_irq,
                                             context,
                                             g_touchirq_handlers[i].arg);
            }
        }
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: touch_restore_irq
 *
 * Description:
 *   IRQ timer callback.
 *   Re-enables touch IRQ after a certain time to avoid spam.
 *
 * Input Parameters:
 *   arg - Pointer to a memory location containing the function arguments.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
static void touch_restore_irq(void *arg)
{
  iinfo("touch_restore_irq: entry\n");
  if (touch_last_irq >= ESP32_FIRST_RTCIOIRQ_TOUCHPAD &&
      touch_last_irq <= ESP32_LAST_RTCIOIRQ_TOUCHPAD)
    {
      int bit = ESP32_IRQ2TOUCHPAD(touch_last_irq);

      if (bit >= 0 && bit < ESP32_NIRQ_RTCIO_TOUCHPAD &&
          g_touchirq_handlers[bit].handler != NULL)
        {
          /* Call the button interrupt handler again so we can detect touch
           * pad releases.
           */

