apache/nuttx/arch/xtensa/src/esp32/esp32_touch.c
          g_touchirq_handlers[bit].handler(touch_last_irq,
                                           NULL,
                                           g_touchirq_handlers[bit].arg);
        }
      else if (touch_release_cb != NULL)
        {
          /* Backward compatible fallback for users of the old release
           * callback API.
           */

          touch_release_cb(touch_last_irq, NULL, NULL);
        }
    }

  touch_lh_intr_enable();
}
#endif

/****************************************************************************
 * Name: touch_init
 *
 * Description:
 *   Initialize the touch pad driver.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_init(void)
{
  if (touch_mux == NULL)
    {
      touch_mux = kmm_zalloc(sizeof(mutex_t));

      if (touch_mux == NULL)
        {
          ierr("Failed to initialize touch pad driver.\n");
          PANIC();
        }

      nxmutex_init(touch_mux);

      irqstate_t flags = spin_lock_irqsave(&lock);

      touch_lh_stop_fsm();
      touch_lh_intr_disable();
      touch_lh_intr_clear();
      touch_lh_clear_channel_mask(TOUCH_BIT_MASK_ALL);
      touch_lh_clear_group_mask(TOUCH_BIT_MASK_ALL, TOUCH_BIT_MASK_ALL);
      touch_lh_set_trigger_mode(TOUCH_TRIGGER_MODE_DEFAULT);
      touch_lh_set_trigger_source(TOUCH_TRIGGER_SOURCE_DEFAULT);
      touch_lh_clear_trigger_status_mask();
      touch_lh_set_meas_time(TOUCH_MEASURE_CYCLE_DEFAULT);
      touch_lh_set_sleep_time(TOUCH_SLEEP_CYCLE_DEFAULT);
      touch_lh_set_fsm_mode(TOUCH_FSM_MODE_DEFAULT);
      touch_lh_start_fsm();

#ifdef CONFIG_ESP32_TOUCH_IRQ
      irq_timer_args.callback = touch_restore_irq;
      irq_timer_args.arg = NULL;
      irq_timer_args.name = "touch_irq";
      irq_timer_args.skip_unhandled_events = false;

      if (esp_hr_timer_create(&irq_timer_args, &irq_timer_handler) != OK)
        {
          ierr("ERROR: esp_hr_timer_create(irq) failed\n");
        }

      int ret = esp32_rtcioirqattach(ESP32_IRQ_RTC_TOUCH,
                                     touch_interrupt,
                                     NULL);
      if (ret != OK)
        {
          ierr("ERROR: esp32_rtcioirqattach() failed: %d\n", ret);
        }
      else
        {
          esp32_rtcioirqenable(ESP32_IRQ_RTC_TOUCH);
        }
#endif

      spin_unlock_irqrestore(&lock, flags);
    }
}

/****************************************************************************
 * Name: touch_filter_iir
 *
 * Description:
 *   Infinite Impulse Response filter function.
 *
 * Input Parameters:
 *   in_now - Raw value to be filtered;
 *   out_last - Last value outputted;
 *   k - The filter coefficient.
 *
 * Returned Value:
 *   Filtered value.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_FILTER
static uint32_t touch_filter_iir(uint32_t in_now,
                                 uint32_t out_last,
                                 uint32_t k)
{
  if (k == 0)
    {
      return in_now;
    }
  else
    {
      uint32_t out_now = (in_now + (k - 1) * out_last) / k;
      return out_now;
    }
}

/****************************************************************************
 * Name: touch_filter_cb
 *
 * Description:
 *   Filter timer callback.
 *   Measures channels, applies filter and restart timers.
 *
 * Input Parameters:
 *   arg - Pointer to a memory location containing the function arguments.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_filter_cb(void *arg)
{
  if (touch_pad_filter == NULL || touch_mux == NULL)
    {
      return;
    }

  uint16_t val = 0;
  static uint32_t filtered_temp[TOUCH_SENSOR_PINS];

  nxmutex_lock(touch_mux);

  for (int i = 0; i < TOUCH_SENSOR_PINS; i++)
    {
      if ((touch_pad_init_bit >> i) & 0x1)
        {
          val = touch_read(i);
          touch_pad_filter->raw_val[i] = val;
          filtered_temp[i] = filtered_temp[i] == 0 ? ((uint32_t)val <<
            TOUCH_PAD_SHIFT_DEFAULT) : filtered_temp[i];
          filtered_temp[i] =
            touch_filter_iir((val << TOUCH_PAD_SHIFT_DEFAULT),
                             filtered_temp[i],
                             TOUCH_PAD_FILTER_FACTOR_DEFAULT);
          touch_pad_filter->filtered_val[i] = (filtered_temp[i] +
            TOUCH_PAD_SHIFT_ROUND_DEFAULT) >> TOUCH_PAD_SHIFT_DEFAULT;
        }
    }

  esp_hr_timer_start_once(touch_pad_filter->filter_timer_handler,
                          touch_pad_filter->period_ms * USEC_PER_MSEC);
  nxmutex_unlock(touch_mux);
}

/****************************************************************************
 * Name: touch_filter_start
 *
 * Description:
 *   Start the touch pad filter.
 *
 * Input Parameters:
 *   filter_period_ms - The filter measurement interval in milliseconds.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_filter_start(uint32_t filter_period_ms)
{
  if (touch_mux == NULL)
    {
      ierr("ERROR: Touch pads not initialized.\n");
      return;
    }

  nxmutex_lock(touch_mux);

  if (touch_pad_filter == NULL)
    {
      touch_pad_filter = (struct touch_filter_s *)
        kmm_zalloc(sizeof(struct touch_filter_s));

      if (touch_pad_filter == NULL)
        {
          ierr("ERROR: Failed to initialize touch filter.\n");
          nxmutex_unlock(touch_mux);
          return;
        }

      touch_pad_filter->filter_timer_args.callback = touch_filter_cb;
      touch_pad_filter->filter_timer_args.arg = NULL;
      touch_pad_filter->filter_timer_args.name = "touch_filter";
      touch_pad_filter->filter_timer_args.skip_unhandled_events = false;

      if (esp_hr_timer_create(&touch_pad_filter->filter_timer_args,
                              &touch_pad_filter->filter_timer_handler) != OK)
        {
          ierr("ERROR: esp_hr_timer_create(filter) failed\n");
          kmm_free(touch_pad_filter);
          touch_pad_filter = NULL;
          nxmutex_unlock(touch_mux);
          return;
        }

      touch_pad_filter->period_ms = filter_period_ms;
    }

