apache/nuttx/arch/xtensa/src/esp32/esp32_touch.c
  nxmutex_unlock(touch_mux);
  touch_filter_cb(NULL);
}
#endif

/****************************************************************************
 * Name: touch_set_group_mask
 *
 * Description:
 *   Activate channels in touch pad groups.
 *
 * Input Parameters:
 *   set1_mask - The SET1 group bitmask;
 *   set2_mask - The SET2 group bitmask;
 *   en_mask - The working group bitmask.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_set_group_mask(uint16_t set1_mask,
                                 uint16_t set2_mask,
                                 uint16_t en_mask)
{
  DEBUGASSERT(set1_mask <= TOUCH_BIT_MASK_ALL &&
              set2_mask <= TOUCH_BIT_MASK_ALL &&
              en_mask <= TOUCH_BIT_MASK_ALL);

  irqstate_t flags = spin_lock_irqsave(&lock);

  touch_lh_set_group_mask(set1_mask, set2_mask);
  touch_lh_set_channel_mask(en_mask);

  spin_unlock_irqrestore(&lock, flags);
}

/****************************************************************************
 * Name: touch_clear_group_mask
 *
 * Description:
 *   Deactivate channels in touch pad groups.
 *
 * Input Parameters:
 *   set1_mask - The SET1 group bitmask;
 *   set2_mask - The SET2 group bitmask;
 *   en_mask - The working group bitmask.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_clear_group_mask(uint16_t set1_mask,
                                   uint16_t set2_mask,
                                   uint16_t en_mask)
{
  DEBUGASSERT(set1_mask <= TOUCH_BIT_MASK_ALL &&
              set2_mask <= TOUCH_BIT_MASK_ALL &&
              en_mask <= TOUCH_BIT_MASK_ALL);

  irqstate_t flags = spin_lock_irqsave(&lock);

  touch_lh_clear_channel_mask(en_mask);
  touch_lh_clear_group_mask(set1_mask, set2_mask);

  spin_unlock_irqrestore(&lock, flags);
}

/****************************************************************************
 * Name: touch_config
 *
 * Description:
 *   Configure a touch pad channel.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   threshold - The interrupt threshold value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_config(enum touch_pad_e tp)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  if (touch_mux == NULL)
    {
      ierr("ERROR: Touch pads not initialized.\n");
      return;
    }

  touch_io_init(tp);

  irqstate_t flags = spin_lock_irqsave(&lock);

  touch_lh_set_slope(tp, TOUCH_SLOPE_DEFAULT);
  touch_lh_set_tie_option(tp, TOUCH_TIE_OPT_DEFAULT);
  touch_lh_set_threshold(tp, TOUCH_THRESHOLD_NO_USE);

  spin_unlock_irqrestore(&lock, flags);

  enum touch_fsm_mode_e mode = touch_lh_get_fsm_mode();

  if (mode == TOUCH_FSM_MODE_SW)
    {
      touch_clear_group_mask((1 << tp), (1 << tp), (1 << tp));
      touch_pad_init_bit |= (1 << tp);
    }
  else
    {
      uint32_t wait_time_ms = 0;
      uint16_t sleep_time = touch_lh_get_sleep_time();
      uint16_t meas_cycle = touch_lh_get_meas_time();
      uint32_t rtc_slow_clk_freq = rtc_clk_slow_freq_get_hz();
      uint32_t rtc_fast_clk_freq = RTC_FAST_CLK_FREQ_APPROX;
      touch_set_group_mask((1 << tp), (1 << tp), (1 << tp));

      /* If the FSM mode is 'TOUCH_FSM_MODE_TIMER', The data will be ready
       * after one measurement cycle, after this function is executed.
       * Otherwise, the "touch_value" by "touch_read" is 0.
       */

      wait_time_ms = sleep_time / (rtc_slow_clk_freq / 1000) + meas_cycle /
        (rtc_fast_clk_freq / 1000);
      up_udelay(wait_time_ms ? wait_time_ms * USEC_PER_MSEC : 1);
      touch_pad_init_bit |= (1 << tp);
    }
}

/****************************************************************************
 * Name: touch_read
 *
 * Description:
 *   Read a touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The read value.
 *
 ****************************************************************************/

static uint16_t touch_read(enum touch_pad_e tp)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  enum touch_fsm_mode_e mode = touch_lh_get_fsm_mode();
  uint16_t val = 0xffff;

  if (mode == TOUCH_FSM_MODE_SW)
    {
      touch_set_group_mask((1 << tp), (1 << tp), (1 << tp));

      irqstate_t flags = spin_lock_irqsave(&lock);
      touch_lh_start_sw_meas();
      spin_unlock_irqrestore(&lock, flags);

      while (!touch_lh_meas_is_done());
      val = touch_lh_read_raw_data(tp);
      touch_clear_group_mask((1 << tp), (1 << tp), (1 << tp));
    }
  else
    {
      while (!touch_lh_meas_is_done());
      val = touch_lh_read_raw_data(tp);
    }

  return val;
}

/****************************************************************************
 * Name: touch_set_voltage
 *
 * Description:
 *   Set the touch pads voltage configuration.
 *
 * Input Parameters:
 *   volt - The new configuration struct.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_set_voltage(struct touch_config_volt_s *volt)
{
  irqstate_t flags = spin_lock_irqsave(&lock);

  touch_lh_set_voltage_high(volt->refh);
  touch_lh_set_voltage_low(volt->refl);
  touch_lh_set_voltage_attenuation(volt->atten);

  spin_unlock_irqrestore(&lock, flags);
}

/****************************************************************************
 * Name: touch_set_meas_mode
 *
 * Description:
 *   Set the measurement mode for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   meas - The new configuration struct.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void touch_set_meas_mode(enum touch_pad_e tp,
                                struct touch_config_meas_mode_s *meas)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  irqstate_t flags = spin_lock_irqsave(&lock);

  touch_lh_set_slope(tp, meas->slope);
  touch_lh_set_tie_option(tp, meas->tie_opt);

  spin_unlock_irqrestore(&lock, flags);
}

/****************************************************************************
 * Name: touch_io_init
 *
 * Description:
 *   Initialize GPIOs for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

