apache/nuttx/arch/xtensa/src/esp32/esp32_touch.c
static void touch_io_init(enum touch_pad_e tp)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  uint8_t rtcio_num = TOUCH_GET_RTCIO_NUM(tp);
  esp32_configrtcio(rtcio_num, RTC_FUNCTION_RTCIO);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_configtouch
 *
 * Description:
 *   Configure a touch pad channel.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   config - The touch pad configuration structure.
 *
 * Returned Value:
 *   OK.
 *
 ****************************************************************************/

int esp32_configtouch(enum touch_pad_e tp, struct touch_config_s config)
{
  struct touch_config_volt_s volt_config =
    {
      .refh = config.refh,
      .refl = config.refl,
      .atten = config.atten
    };

  struct touch_config_meas_mode_s meas_config =
    {
      .slope = config.slope,
      .tie_opt = config.tie_opt
    };

  touch_init();

  /* Make sure to set the mode before enabling the touch pad as it influences
   * the configuration
   */

  touch_set_meas_mode(tp, &meas_config);
  touch_lh_set_fsm_mode(config.fsm_mode);
  touch_set_voltage(&volt_config);
  touch_config(tp);

#ifdef CONFIG_ESP32_TOUCH_FILTER
  touch_filter_start(config.filter_period);
#endif

  return OK;
}

/****************************************************************************
 * Name: esp32_touchread
 *
 * Description:
 *   Read a touch pad channel.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   0 if touch pad pressed, 1 if released.
 *
 ****************************************************************************/

bool esp32_touchread(enum touch_pad_e tp)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  uint16_t value = esp32_touchreadraw(tp);

  return (value > touch_pad_logic_threshold[tp]);
}

/****************************************************************************
 * Name: esp32_touchreadraw
 *
 * Description:
 *   Read the analog value of a touch pad channel.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The number of charge and discharge cycles done in the last measurement.
 *
 ****************************************************************************/

uint16_t esp32_touchreadraw(enum touch_pad_e tp)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

#ifdef CONFIG_ESP32_TOUCH_FILTER
  uint16_t value = touch_pad_filter->filtered_val[tp];
#else
  uint16_t value = touch_read(tp);
#endif

  iinfo("Touch pad %d value: %u\n", tp, value);

  return value;
}

/****************************************************************************
 * Name: esp32_touchsetthreshold
 *
 * Description:
 *   Configure the threshold for a touch pad channel.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   threshold - The threshold value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32_touchsetthreshold(enum touch_pad_e tp, uint16_t threshold)
{
  DEBUGASSERT(tp < TOUCH_SENSOR_PINS);

  iinfo("Setting touch pad %d threshold to %u.\n", tp, threshold);

  touch_lh_set_threshold(tp, threshold);
  touch_pad_logic_threshold[tp] = threshold;
}

/****************************************************************************
 * Name: esp32_touchirqenable
 *
 * Description:
 *   Enable the interrupt for the specified touch pad.
 *
 * Input Parameters:
 *   irq - The touch pad irq number.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
void esp32_touchirqenable(int irq)
{
  DEBUGASSERT(irq >= ESP32_FIRST_RTCIOIRQ_TOUCHPAD &&
              irq <= ESP32_LAST_RTCIOIRQ_TOUCHPAD);

  int bit = ESP32_IRQ2TOUCHPAD(irq);

  touch_lh_intr_disable();

  touch_pad_isr_enabled |= (UINT32_C(1) << bit);

  touch_lh_intr_enable();
}
#endif

/****************************************************************************
 * Name: esp32_touchirqdisable
 *
 * Description:
 *   Disable the interrupt for the specified touch pad.
 *
 * Input Parameters:
 *   irq - The touch pad irq number.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
void esp32_touchirqdisable(int irq)
{
  DEBUGASSERT(irq >= ESP32_FIRST_RTCIOIRQ_TOUCHPAD &&
              irq <= ESP32_LAST_RTCIOIRQ_TOUCHPAD);

  int bit = ESP32_IRQ2TOUCHPAD(irq);

  touch_lh_intr_disable();

  touch_pad_isr_enabled &= (~(UINT32_C(1) << bit));

  touch_lh_intr_enable();
}
#endif

/****************************************************************************
 * Name: esp32_touchirqattach
 *
 * Description:
 *   Attach an interrupt handler to a specified touch pad IRQ.
 *
 * Input Parameters:
 *   irq     - Touch pad IRQ number to attach the handler to
 *   handler - Interrupt handler function
 *   arg     - Argument to pass to the handler
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned
 *   to indicate the nature of any failure.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
int esp32_touchirqattach(int irq, xcpt_t handler, void *arg)
{
  int bit;

  DEBUGASSERT(irq >= ESP32_FIRST_RTCIOIRQ_TOUCHPAD &&
              irq <= ESP32_LAST_RTCIOIRQ_TOUCHPAD);

  bit = ESP32_IRQ2TOUCHPAD(irq);
  if (bit < 0 || bit >= ESP32_NIRQ_RTCIO_TOUCHPAD)
    {
      return -EINVAL;
    }

  g_touchirq_handlers[bit].handler = handler;
  g_touchirq_handlers[bit].arg = arg;

  return OK;
}

/****************************************************************************
 * Name: esp32_touchirqdetach
 *
 * Description:
 *   Detach the interrupt handler for the specified touch pad IRQ and
 *   disable the interrupt.
 *
 * Input Parameters:
 *   irq - Touch pad IRQ number to detach.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned
 *   to indicate the nature of any failure.
 *
 ****************************************************************************/

int esp32_touchirqdetach(int irq)
{
  int bit;

  DEBUGASSERT(irq >= ESP32_FIRST_RTCIOIRQ_TOUCHPAD &&
              irq <= ESP32_LAST_RTCIOIRQ_TOUCHPAD);

  bit = ESP32_IRQ2TOUCHPAD(irq);
  if (bit < 0 || bit >= ESP32_NIRQ_RTCIO_TOUCHPAD)
    {
      return -EINVAL;
    }

  touch_lh_intr_disable();

  g_touchirq_handlers[bit].handler = NULL;
  g_touchirq_handlers[bit].arg = NULL;
  touch_pad_isr_enabled &= (~(UINT32_C(1) << bit));

  touch_lh_intr_enable();

  return OK;
}
#endif

/****************************************************************************
 * Name: esp32_touchregisterreleasecb
 *
 * Description:
 *   Register the release callback.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_TOUCH_IRQ
void esp32_touchregisterreleasecb(int (*func)(int, void *, void *))
{
  DEBUGASSERT(func != NULL);

  touch_release_cb = func;
}
#endif
